Thanks for sharing the log but I don't get much from the log why its failing at the order of the receipt..I tried same template multiple times from our end 
```
Terraform will perform the following actions:

2021/04/01 19:52:09 [DEBUG] command: asking for input: "Do you want to perform these actions?"
  # ibm_compute_vm_instance.virtual_server will be created
  + resource "ibm_compute_vm_instance" "virtual_server" {
      + block_storage_ids          = (known after apply)
      + cores                      = (known after apply)
      + datacenter                 = "dal06"
      + disks                      = (known after apply)
      + domain                     = "test.com"
      + file_storage_ids           = (known after apply)
      + flavor_key_name            = (known after apply)
      + hostname                   = "poc-n1"
      + hourly_billing             = true
      + id                         = (known after apply)
      + ip_address_id              = (known after apply)
      + ip_address_id_private      = (known after apply)
      + ipv4_address               = (known after apply)
      + ipv4_address_private       = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_address_id            = (known after apply)
      + ipv6_enabled               = false
      + ipv6_static_enabled        = false
      + local_disk                 = true
      + memory                     = (known after apply)
      + network_speed              = 100
      + private_interface_id       = (known after apply)
      + private_network_only       = false
      + private_security_group_ids = (known after apply)
      + private_subnet             = (known after apply)
      + private_subnet_id          = (known after apply)
      + private_vlan_id            = 3062096
      + public_bandwidth_limited   = (known after apply)
      + public_bandwidth_unlimited = false
      + public_interface_id        = (known after apply)
      + public_ipv6_subnet         = (known after apply)
      + public_ipv6_subnet_id      = (known after apply)
      + public_security_group_ids  = [
          + 3542044,
        ]
      + public_subnet              = (known after apply)
      + public_subnet_id           = (known after apply)
      + public_vlan_id             = 3062094
      + quote_id                   = 2877174
      + resource_controller_url    = (known after apply)
      + resource_name              = (known after apply)
      + resource_status            = (known after apply)
      + secondary_ip_addresses     = (known after apply)
      + ssh_key_ids                = [
          + 2056100,
        ]
      + wait_time_minutes          = 90
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2021/04/01 19:52:11 [INFO] backend/local: apply calling Apply
2021/04/01 19:52:11 [INFO] terraform: building graph: GraphTypeApply
2021/04/01 19:52:11 [DEBUG] Resource state not found for node "ibm_compute_vm_instance.virtual_server", instance ibm_compute_vm_instance.virtual_server
2021/04/01 19:52:11 [DEBUG] adding implicit provider configuration provider.ibm, implied first by ibm_compute_vm_instance.virtual_server (prepare state)
2021/04/01 19:52:11 [DEBUG] ProviderTransformer: "ibm_compute_vm_instance.virtual_server (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2021/04/01 19:52:11 [DEBUG] ProviderTransformer: "ibm_compute_vm_instance.virtual_server" (*terraform.NodeApplyableResourceInstance) needs provider.ibm
2021/04/01 19:52:11 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.virtual_server (prepare state)" references: []
2021/04/01 19:52:11 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.virtual_server" references: []
2021/04/01 19:52:11 [DEBUG] ReferenceTransformer: "provider.ibm" references: []
2021/04/01 19:52:11 [DEBUG] Starting graph walk: walkApply
2021-04-01T19:52:11.461+0530 [INFO]  plugin: configuring client automatic mTLS
2021-04-01T19:52:11.483+0530 [DEBUG] plugin: starting plugin: path=/Users/harinireddy/terraform/terraform-provider-ibm args=[/Users/harinireddy/terraform/terraform-provider-ibm]
2021-04-01T19:52:11.489+0530 [DEBUG] plugin: plugin started: path=/Users/harinireddy/terraform/terraform-provider-ibm pid=47681
2021-04-01T19:52:11.489+0530 [DEBUG] plugin: waiting for RPC address: path=/Users/harinireddy/terraform/terraform-provider-ibm
2021-04-01T19:52:11.514+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:11 IBM Cloud Provider version 1.22.0  
2021-04-01T19:52:11.519+0530 [INFO]  plugin.terraform-provider-ibm: configuring server automatic mTLS: timestamp=2021-04-01T19:52:11.519+0530
2021-04-01T19:52:11.539+0530 [DEBUG] plugin: using plugin: version=5
2021-04-01T19:52:11.539+0530 [DEBUG] plugin.terraform-provider-ibm: plugin address: address=/var/folders/mk/76ksfld97q72r64b7q4v28_r0000gn/T/plugin551995252 network=unix timestamp=2021-04-01T19:52:11.539+0530
2021-04-01T19:52:11.603+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:11 Configuring SoftLayer Session with API key: timestamp=2021-04-01T19:52:11.603+0530
2021-04-01T19:52:11.603+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:11 Configuring IBM Cloud Session with API key: timestamp=2021-04-01T19:52:11.603+0530
2021-04-01T19:52:11.603+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:11 [INFO] Configured Region: us-south: timestamp=2021-04-01T19:52:11.603+0530
2021-04-01T19:52:13.350+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2021-04-01T19:52:13.350+0530
2021-04-01T19:52:13.350+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2021-04-01T19:52:13.350+0530
2021/04/01 19:52:13 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_compute_vm_instance.virtual_server, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .wait_time_minutes: planned value cty.NumberIntVal(90) does not match config value cty.NullVal(cty.Number)
      - .ssh_key_ids: planned value cty.SetVal([]cty.Value{cty.NumberIntVal(2.0561e+06)}) does not match config value cty.SetVal([]cty.Value{cty.NumberIntVal(2.0561e+06)})
      - .local_disk: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .private_network_only: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .public_security_group_ids: planned value cty.SetVal([]cty.Value{cty.NumberIntVal(3.542044e+06)}) does not match config value cty.SetVal([]cty.Value{cty.NumberIntVal(3.542044e+06)})
      - .ipv6_static_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .hourly_billing: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .public_bandwidth_unlimited: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .network_speed: planned value cty.NumberIntVal(100) does not match config value cty.NullVal(cty.Number)
ibm_compute_vm_instance.virtual_server: Creating...
2021/04/01 19:52:13 [DEBUG] ibm_compute_vm_instance.virtual_server: applying the planned Create change
2021-04-01T19:52:13.357+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [DEBUG] setting computed for "private_security_group_ids" from ComputedKeys: timestamp=2021-04-01T19:52:13.357+0530
2021-04-01T19:52:13.357+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [DEBUG] setting computed for "secondary_ip_addresses" from ComputedKeys: timestamp=2021-04-01T19:52:13.357+0530
2021-04-01T19:52:13.357+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [DEBUG] setting computed for "disks" from ComputedKeys: timestamp=2021-04-01T19:52:13.357+0530
2021-04-01T19:52:13.357+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [DEBUG] setting computed for "file_storage_ids" from ComputedKeys: timestamp=2021-04-01T19:52:13.357+0530
2021-04-01T19:52:13.357+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [DEBUG] setting computed for "block_storage_ids" from ComputedKeys: timestamp=2021-04-01T19:52:13.357+0530
2021-04-01T19:52:13.370+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [DEBUG] Request URL:  POST https://api.softlayer.com/rest/v3/SoftLayer_Billing_Order_Quote/2877174/getRecalculatedOrderContainer.json
2021-04-01T19:52:13.370+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:13 [DEBUG] Parameters:  {"parameters":[null,false]}
2021-04-01T19:52:15.678+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:15 [DEBUG] Status Code:  200
"VPN Management - Private Network","quantityLimit":0,"sortOrder":115,"questions":[]},"thirdPartyPolicyAssignments":[]},"orderPremiums":[],"reservedCapacityInstanceFlag":false}],"primaryDiskPartitionId":1,"privateCloudOrderFlag":false,"proratedInitialCharge":"67.85","proratedOrderTotal":"67.85","quantity":1,"resourceGroupId":null,"resourceGroupTemplateId":null,"sendQuoteEmailFlag":null,"serverCoreCount":null,"sourceVirtualGuestId":null,"stepId":null,"storageGroups":[],"taxCompletedFlag":false,"totalRecurringTax":"0","totalSetupTax":"0","usagePrices":[],"useHourlyPricing":false,"clusterResourceId":null,"monitoringAgentConfigurationTemplateGroupId":null,"requiredUpstreamDeviceId":null,"bootableDiskId":null,"hostId":null,"reservedCapacityId":null}
2021-04-01T19:52:15.680+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:15 [DEBUG] Request URL:  POST https://api.softlayer.com/rest/v3/SoftLayer_Product_Order/placeOrder.json
N Users","id":309,"itemCategory":{"categoryCode":"vpn_management","id":31,"name":"VPN Management - Private Network","quantityLimit":0,"sortOrder":115},"itemTaxCategoryId":166,"keyName":"UNLIMITED_SSL_VPN_USERS_1_PPTP_VPN_USER_PER_ACCOUNT"},"itemId":309,"laborFee":0,"oneTimeFee":0,"oneTimeFeeTax":0,"proratedRecurringFee":0,"proratedRecurringFeeTax":0,"recurringFee":0,"recurringFeeTax":0,"reservedCapacityInstanceFlag":false,"setupFee":0,"sort":0}],"primaryDiskPartitionId":1,"privateCloudOrderFlag":false,"proratedInitialCharge":67.85,"proratedOrderTotal":67.85,"quantity":1,"sshKeys":[{"sshKeyIds":[2056100]}],"taxCompletedFlag":false,"totalRecurringTax":0,"totalSetupTax":0,"useHourlyPricing":false,"virtualGuests":[{"datacenter":{"name":"dal06"},"domain":"test.com","hostname":"poc-n1","hourlyBillingFlag":true,"localDiskFlag":true,"networkComponents":[{"maxSpeed":100}],"postInstallScriptUri":"","primaryBackendNetworkComponent":{"networkVlan":{"id":3062096}},"primaryNetworkComponent":{"networkVlan":{"id":3062094},"securityGroupBindings":[{"securityGroupId":3542044}]},"privateNetworkOnlyFlag":false,"sshKeys":[{"id":2056100}]}]}]},false]}
2021-04-01T19:52:19.993+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:19 [DEBUG] Status Code:  200
:"0","parentId":810718960,"promoCodeId":null,"recurringFee":"0","setupFee":"0"},{"categoryCode":"response","description":"Automated Notification","id":810718984,"itemId":52,"itemPriceId":"32627","laborFee":"0","oneTimeFee":"0","parentId":810718960,"promoCodeId":null,"recurringFee":"0","setupFee":"0"},{"categoryCode":"vpn_management","description":"Unlimited SSL VPN Users","id":810718986,"itemId":309,"itemPriceId":"16594","laborFee":"0","oneTimeFee":"0","parentId":810718960,"promoCodeId":null,"recurringFee":"0","setupFee":"0"}],"userRecord":{"accountId":1982440,"firstName":"HARINI","id":7787426,"lastName":"KANTAREDDY","username":"IBM1982440"}}}
2021-04-01T19:52:19.996+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:19 [INFO] Virtual Machine ID: 118459208: timestamp=2021-04-01T19:52:19.996+0530
2021-04-01T19:52:19.996+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:19 Waiting for server (118459208) to be available.: timestamp=2021-04-01T19:52:19.996+0530
2021-04-01T19:52:19.996+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:19 [DEBUG] Waiting for state to become: [available]: timestamp=2021-04-01T19:52:19.996+0530
ibm_compute_vm_instance.virtual_server: Still creating... [10s elapsed]
2021-04-01T19:52:30.000+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:30 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:52:30.000+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:30 [DEBUG] Parameters:  
2021-04-01T19:52:31.402+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:31 [DEBUG] Status Code:  200
2021-04-01T19:52:31.402+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:31 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:22:30-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":5,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:29-05:00","statusChangeDate":"2021-04-01T09:22:26-05:00","transactionStatus":{"averageDuration":"1.48","friendlyName":"Assign Host","name":"ASSIGN_HOST"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:52:31.402+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:31 Checking active transactions.: timestamp=2021-04-01T19:52:31.402+0530
2021-04-01T19:52:31.402+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:31 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:52:31.402+0530
ibm_compute_vm_instance.virtual_server: Still creating... [20s elapsed]
2021-04-01T19:52:41.407+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:41 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:52:41.407+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:41 [DEBUG] Parameters:  
2021-04-01T19:52:42.701+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:42 [DEBUG] Status Code:  200
2021-04-01T19:52:42.702+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:42 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:22:30-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":16,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:35-05:00","statusChangeDate":"2021-04-01T09:22:26-05:00","transactionStatus":{"averageDuration":"1.48","friendlyName":"Assign Host","name":"ASSIGN_HOST"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:52:42.702+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:42 Checking active transactions.: timestamp=2021-04-01T19:52:42.702+0530
2021-04-01T19:52:42.702+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:42 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:52:42.702+0530
ibm_compute_vm_instance.virtual_server: Still creating... [30s elapsed]
2021-04-01T19:52:52.707+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:52 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:52:52.707+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:52 [DEBUG] Parameters:  
ibm_compute_vm_instance.virtual_server: Still creating... [40s elapsed]
2021-04-01T19:52:53.993+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:53 [DEBUG] Status Code:  200
2021-04-01T19:52:53.993+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:52:53 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:22:30-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":0,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:52:53.993+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:53 Checking active transactions.: timestamp=2021-04-01T19:52:53.993+0530
2021-04-01T19:52:53.993+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:52:53 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:52:53.993+0530
ibm_compute_vm_instance.virtual_server: Still creating... [50s elapsed]
2021-04-01T19:53:03.997+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:03 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:53:03.997+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:03 [DEBUG] Parameters:  
2021-04-01T19:53:05.434+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:05 [DEBUG] Status Code:  200
2021-04-01T19:53:05.434+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:05 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:22:30-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":12,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:53:05.434+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:05 Checking active transactions.: timestamp=2021-04-01T19:53:05.434+0530
2021-04-01T19:53:05.434+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:05 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:53:05.434+0530
ibm_compute_vm_instance.virtual_server: Still creating... [1m0s elapsed]
2021-04-01T19:53:15.438+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:15 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:53:15.438+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:15 [DEBUG] Parameters:  
2021-04-01T19:53:16.738+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:16 [DEBUG] Status Code:  200
2021-04-01T19:53:16.738+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:16 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":23,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:53:16.739+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:16 Checking active transactions.: timestamp=2021-04-01T19:53:16.738+0530
2021-04-01T19:53:16.739+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:16 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:53:16.738+0530
ibm_compute_vm_instance.virtual_server: Still creating... [1m10s elapsed]
2021-04-01T19:53:26.744+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:26 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:53:26.744+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:26 [DEBUG] Parameters:  
2021-04-01T19:53:28.007+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:28 [DEBUG] Status Code:  200
2021-04-01T19:53:28.007+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:28 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":34,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:53:28.007+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:28 Checking active transactions.: timestamp=2021-04-01T19:53:28.007+0530
2021-04-01T19:53:28.007+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:28 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:53:28.007+0530
ibm_compute_vm_instance.virtual_server: Still creating... [1m20s elapsed]
2021-04-01T19:53:38.010+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:38 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:53:38.010+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:38 [DEBUG] Parameters:  
2021-04-01T19:53:39.249+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:39 [DEBUG] Status Code:  200
2021-04-01T19:53:39.249+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:39 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":46,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:53:39.249+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:39 Checking active transactions.: timestamp=2021-04-01T19:53:39.249+0530
2021-04-01T19:53:39.249+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:39 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:53:39.249+0530
ibm_compute_vm_instance.virtual_server: Still creating... [1m30s elapsed]
2021-04-01T19:53:49.253+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:49 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:53:49.253+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:49 [DEBUG] Parameters:  
2021-04-01T19:53:50.606+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:50 [DEBUG] Status Code:  200
2021-04-01T19:53:50.606+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:53:50 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":57,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:53:50.607+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:50 Checking active transactions.: timestamp=2021-04-01T19:53:50.607+0530
2021-04-01T19:53:50.607+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:53:50 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:53:50.607+0530
ibm_compute_vm_instance.virtual_server: Still creating... [1m40s elapsed]
2021-04-01T19:54:00.600+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:00 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:54:00.600+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:00 [DEBUG] Parameters:  
2021-04-01T19:54:01.821+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:01 [DEBUG] Status Code:  200
2021-04-01T19:54:01.821+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:01 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":68,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:54:01.822+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:01 Checking active transactions.: timestamp=2021-04-01T19:54:01.821+0530
2021-04-01T19:54:01.822+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:01 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:54:01.822+0530
ibm_compute_vm_instance.virtual_server: Still creating... [1m50s elapsed]
2021-04-01T19:54:11.817+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:11 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:54:11.817+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:11 [DEBUG] Parameters:  
2021-04-01T19:54:13.051+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:13 [DEBUG] Status Code:  200
2021-04-01T19:54:13.052+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:13 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":79,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:54:13.052+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:13 Checking active transactions.: timestamp=2021-04-01T19:54:13.052+0530
2021-04-01T19:54:13.052+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:13 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:54:13.052+0530
ibm_compute_vm_instance.virtual_server: Still creating... [2m0s elapsed]
2021-04-01T19:54:23.054+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:23 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:54:23.054+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:23 [DEBUG] Parameters:  
ibm_compute_vm_instance.virtual_server: Still creating... [2m10s elapsed]
2021-04-01T19:54:24.413+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:24 [DEBUG] Status Code:  200
2021-04-01T19:54:24.413+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:24 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":91,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:22:53-05:00","statusChangeDate":"2021-04-01T09:22:53-05:00","transactionStatus":{"averageDuration":"1.35","friendlyName":"Setup provision configuration","name":"CLOUD_PROVISION_SETUP"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:54:24.413+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:24 Checking active transactions.: timestamp=2021-04-01T19:54:24.413+0530
2021-04-01T19:54:24.413+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:24 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:54:24.413+0530
ibm_compute_vm_instance.virtual_server: Still creating... [2m20s elapsed]
2021-04-01T19:54:34.416+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:34 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:54:34.416+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:34 [DEBUG] Parameters:  
2021-04-01T19:54:35.795+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:35 [DEBUG] Status Code:  200
2021-04-01T19:54:35.795+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:35 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":4,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:31-05:00","statusChangeDate":"2021-04-01T09:24:31-05:00","transactionStatus":{"averageDuration":".29","friendlyName":"Cloud Send Software Install","name":"CLOUD_SEND_SOFTWARE_INSTALL"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:54:35.796+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:35 Checking active transactions.: timestamp=2021-04-01T19:54:35.796+0530
2021-04-01T19:54:35.796+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:35 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:54:35.796+0530
ibm_compute_vm_instance.virtual_server: Still creating... [2m30s elapsed]
2021-04-01T19:54:45.800+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:45 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:54:45.800+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:45 [DEBUG] Parameters:  
2021-04-01T19:54:47.062+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:47 [DEBUG] Status Code:  200
2021-04-01T19:54:47.062+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:47 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":2,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:44-05:00","statusChangeDate":"2021-04-01T09:24:44-05:00","transactionStatus":{"averageDuration":"1.64","friendlyName":"Install Software","name":"INSTALL_SOFTWARE"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:54:47.062+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:47 Checking active transactions.: timestamp=2021-04-01T19:54:47.062+0530
2021-04-01T19:54:47.062+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:47 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:54:47.062+0530
ibm_compute_vm_instance.virtual_server: Still creating... [2m40s elapsed]
2021-04-01T19:54:57.065+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:57 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:54:57.065+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:57 [DEBUG] Parameters:  
2021-04-01T19:54:58.330+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:58 [DEBUG] Status Code:  200
2021-04-01T19:54:58.330+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:54:58 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":9,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:49-05:00","statusChangeDate":"2021-04-01T09:24:49-05:00","transactionStatus":{"averageDuration":".46","name":"LAMP_START"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:54:58.330+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:58 Checking active transactions.: timestamp=2021-04-01T19:54:58.330+0530
2021-04-01T19:54:58.330+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:54:58 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:54:58.330+0530
ibm_compute_vm_instance.virtual_server: Still creating... [2m50s elapsed]
2021-04-01T19:55:08.335+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:08 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:55:08.335+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:08 [DEBUG] Parameters:  
2021-04-01T19:55:10.668+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:10 [DEBUG] Status Code:  200
2021-04-01T19:55:10.668+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:10 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":21,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:49-05:00","statusChangeDate":"2021-04-01T09:24:49-05:00","transactionStatus":{"averageDuration":".46","name":"LAMP_START"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:55:10.669+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:10 Checking active transactions.: timestamp=2021-04-01T19:55:10.669+0530
2021-04-01T19:55:10.669+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:10 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:55:10.669+0530
ibm_compute_vm_instance.virtual_server: Still creating... [3m0s elapsed]
2021-04-01T19:55:20.674+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:20 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:55:20.674+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:20 [DEBUG] Parameters:  
2021-04-01T19:55:22.006+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:22 [DEBUG] Status Code:  200
2021-04-01T19:55:22.006+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:22 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":32,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:49-05:00","statusChangeDate":"2021-04-01T09:24:49-05:00","transactionStatus":{"averageDuration":".46","name":"LAMP_START"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:55:22.007+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:22 Checking active transactions.: timestamp=2021-04-01T19:55:22.006+0530
2021-04-01T19:55:22.007+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:22 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:55:22.007+0530
ibm_compute_vm_instance.virtual_server: Still creating... [3m10s elapsed]
2021-04-01T19:55:32.011+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:32 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:55:32.011+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:32 [DEBUG] Parameters:  
2021-04-01T19:55:33.285+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:33 [DEBUG] Status Code:  200
2021-04-01T19:55:33.285+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:33 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":44,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:49-05:00","statusChangeDate":"2021-04-01T09:24:49-05:00","transactionStatus":{"averageDuration":".46","name":"LAMP_START"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:55:33.286+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:33 Checking active transactions.: timestamp=2021-04-01T19:55:33.286+0530
2021-04-01T19:55:33.286+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:33 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:55:33.286+0530
ibm_compute_vm_instance.virtual_server: Still creating... [3m20s elapsed]
2021-04-01T19:55:43.290+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:43 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:55:43.291+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:43 [DEBUG] Parameters:  
ibm_compute_vm_instance.virtual_server: Still creating... [3m30s elapsed]
2021-04-01T19:55:44.558+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:44 [DEBUG] Status Code:  200
2021-04-01T19:55:44.558+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:44 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":55,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:49-05:00","statusChangeDate":"2021-04-01T09:24:49-05:00","transactionStatus":{"averageDuration":".46","name":"LAMP_START"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:55:44.558+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:44 Checking active transactions.: timestamp=2021-04-01T19:55:44.558+0530
2021-04-01T19:55:44.558+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:44 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:55:44.558+0530
ibm_compute_vm_instance.virtual_server: Still creating... [3m40s elapsed]
2021-04-01T19:55:54.561+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:54 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:55:54.561+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:54 [DEBUG] Parameters:  
2021-04-01T19:55:55.856+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:55 [DEBUG] Status Code:  200
2021-04-01T19:55:55.856+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:55:55 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":66,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:49-05:00","statusChangeDate":"2021-04-01T09:24:49-05:00","transactionStatus":{"averageDuration":".46","name":"LAMP_START"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:55:55.856+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:55 Checking active transactions.: timestamp=2021-04-01T19:55:55.856+0530
2021-04-01T19:55:55.856+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:55:55 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:55:55.856+0530
ibm_compute_vm_instance.virtual_server: Still creating... [3m50s elapsed]
2021-04-01T19:56:05.861+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:05 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:56:05.861+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:05 [DEBUG] Parameters:  
2021-04-01T19:56:08.528+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:08 [DEBUG] Status Code:  200
2021-04-01T19:56:08.528+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:08 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":79,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:24:49-05:00","statusChangeDate":"2021-04-01T09:24:49-05:00","transactionStatus":{"averageDuration":".46","name":"LAMP_START"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:56:08.529+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:08 Checking active transactions.: timestamp=2021-04-01T19:56:08.529+0530
2021-04-01T19:56:08.529+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:08 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:56:08.529+0530
ibm_compute_vm_instance.virtual_server: Still creating... [4m0s elapsed]
2021-04-01T19:56:18.531+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:18 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:56:18.531+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:18 [DEBUG] Parameters:  
2021-04-01T19:56:19.988+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:19 [DEBUG] Status Code:  200
2021-04-01T19:56:19.988+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:19 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":10,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:26:09-05:00","statusChangeDate":"2021-04-01T09:26:09-05:00","transactionStatus":{"averageDuration":".2","name":"LAMP_END"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:56:19.988+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:19 Checking active transactions.: timestamp=2021-04-01T19:56:19.988+0530
2021-04-01T19:56:19.988+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:19 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:56:19.988+0530
ibm_compute_vm_instance.virtual_server: Still creating... [4m10s elapsed]
2021-04-01T19:56:29.993+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:29 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:56:29.993+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:29 [DEBUG] Parameters:  
2021-04-01T19:56:31.229+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:31 [DEBUG] Status Code:  200
2021-04-01T19:56:31.229+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:31 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":4,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:26:27-05:00","statusChangeDate":"2021-04-01T09:26:27-05:00","transactionStatus":{"averageDuration":"1.78","friendlyName":"Final Reboot","name":"FINAL_REBOOT"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:56:31.230+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:31 Checking active transactions.: timestamp=2021-04-01T19:56:31.230+0530
2021-04-01T19:56:31.230+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:31 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:56:31.230+0530
ibm_compute_vm_instance.virtual_server: Still creating... [4m20s elapsed]
2021-04-01T19:56:41.235+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:41 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:56:41.235+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:41 [DEBUG] Parameters:  
2021-04-01T19:56:42.460+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:42 [DEBUG] Status Code:  200
2021-04-01T19:56:42.460+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:42 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":15,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:26:27-05:00","statusChangeDate":"2021-04-01T09:26:27-05:00","transactionStatus":{"averageDuration":"1.78","friendlyName":"Final Reboot","name":"FINAL_REBOOT"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:56:42.460+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:42 Checking active transactions.: timestamp=2021-04-01T19:56:42.460+0530
2021-04-01T19:56:42.461+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:42 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:56:42.460+0530
ibm_compute_vm_instance.virtual_server: Still creating... [4m30s elapsed]
2021-04-01T19:56:52.464+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:52 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:56:52.464+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:52 [DEBUG] Parameters:  
ibm_compute_vm_instance.virtual_server: Still creating... [4m40s elapsed]
2021-04-01T19:56:53.752+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:53 [DEBUG] Status Code:  200
2021-04-01T19:56:53.752+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:56:53 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":26,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:26:27-05:00","statusChangeDate":"2021-04-01T09:26:27-05:00","transactionStatus":{"averageDuration":"1.78","friendlyName":"Final Reboot","name":"FINAL_REBOOT"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:56:53.752+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:53 Checking active transactions.: timestamp=2021-04-01T19:56:53.752+0530
2021-04-01T19:56:53.752+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:56:53 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:56:53.752+0530
ibm_compute_vm_instance.virtual_server: Still creating... [4m50s elapsed]
2021-04-01T19:57:03.755+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:03 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:57:03.755+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:03 [DEBUG] Parameters:  
2021-04-01T19:57:05.106+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:05 [DEBUG] Status Code:  200
2021-04-01T19:57:05.106+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:05 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:23:14-05:00","placementGroupId":null,"provisionDate":null,"startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":37,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:26:27-05:00","statusChangeDate":"2021-04-01T09:26:27-05:00","transactionStatus":{"averageDuration":"1.78","friendlyName":"Final Reboot","name":"FINAL_REBOOT"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:57:05.106+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:57:05 Checking active transactions.: timestamp=2021-04-01T19:57:05.106+0530
2021-04-01T19:57:05.106+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:57:05 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:57:05.106+0530
ibm_compute_vm_instance.virtual_server: Still creating... [5m0s elapsed]
2021-04-01T19:57:15.108+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:15 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:57:15.109+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:15 [DEBUG] Parameters:  
2021-04-01T19:57:16.431+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:16 [DEBUG] Status Code:  200
2021-04-01T19:57:16.431+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:16 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:27:13-05:00","placementGroupId":null,"provisionDate":"2021-04-01T09:27:13-05:00","startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","activeTransaction":{"createDate":"2021-04-01T09:22:26-05:00","elapsedSeconds":5,"guestId":118459208,"hardwareId":null,"id":237949008,"modifyDate":"2021-04-01T09:27:13-05:00","statusChangeDate":"2021-04-01T09:27:11-05:00","transactionStatus":{"averageDuration":".31","friendlyName":"Publish server data","name":"PUBLISH_SERVER_DATA"}},"globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:57:16.431+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:57:16 Checking active transactions.: timestamp=2021-04-01T19:57:16.431+0530
2021-04-01T19:57:16.431+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:57:16 [TRACE] Waiting 10s before next try: timestamp=2021-04-01T19:57:16.431+0530
ibm_compute_vm_instance.virtual_server: Still creating... [5m10s elapsed]
2021-04-01T19:57:26.436+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:26 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5BactiveTransaction%2CprimaryBackendIpAddress%2CprimaryIpAddress%5D
2021-04-01T19:57:26.436+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:26 [DEBUG] Parameters:  
2021-04-01T19:57:27.763+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:27 [DEBUG] Status Code:  200
2021-04-01T19:57:27.763+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:27 [DEBUG] Response:  {"accountId":1982440,"createDate":"2021-04-01T09:22:18-05:00","dedicatedAccountHostOnlyFlag":false,"domain":"test.com","fullyQualifiedDomainName":"poc-n1.test.com","hostname":"poc-n1","id":118459208,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":2,"maxCpuUnits":"CORE","maxMemory":8192,"metricPollDate":null,"modifyDate":"2021-04-01T09:27:13-05:00","placementGroupId":null,"provisionDate":"2021-04-01T09:27:13-05:00","startCpus":2,"statusId":1001,"typeId":1,"uuid":"bbc5f760-5d69-3f5e-39b9-98d92f436418","globalIdentifier":"909c9c16-94d0-4a7b-b177-475be3741023","managedResourceFlag":false,"primaryBackendIpAddress":"10.146.80.230","primaryIpAddress":"169.45.4.53","status":{"keyName":"ACTIVE","name":"Active"}}
2021-04-01T19:57:27.764+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:57:27 Checking active transactions.: timestamp=2021-04-01T19:57:27.764+0530
2021-04-01T19:57:27.764+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:57:27 Checking primary backend IP address.: timestamp=2021-04-01T19:57:27.764+0530
2021-04-01T19:57:27.764+0530 [INFO]  plugin.terraform-provider-ibm: 2021/04/01 19:57:27 Checking primary IP address.: timestamp=2021-04-01T19:57:27.764+0530
2021-04-01T19:57:27.764+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:27 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/118459208.json?objectMask=mask%5Bhostname%2Cdomain%2CblockDevices%5BdiskImage%5D%2CstartCpus%2CmaxMemory%2CdedicatedAccountHostOnlyFlag%2CoperatingSystemReferenceCode%2CblockDeviceTemplateGroup%5Bid%5D%2CtransientGuestFlag%2CbillingItem%5BorderItem%5Bpreset%5BkeyName%5D%5D%5D%2CprimaryIpAddress%2CprimaryBackendIpAddress%2CprivateNetworkOnlyFlag%2ChourlyBillingFlag%2ClocalDiskFlag%2CallowedNetworkStorage%5Bid%2CnasType%5D%2Cnotes%2CuserData%5Bvalue%5D%2CtagReferences%5Bid%2Ctag%5Bname%5D%5D%2Cdatacenter%5Bid%2Cname%2ClongName%5D%2CsshKeys%2Cstatus%5BkeyName%2Cname%5D%2CprimaryNetworkComponent%5BnetworkVlan%5Bid%5D%2Csubnets%2CprimaryVersion6IpAddressRecord%5Bsubnet%2CguestNetworkComponentBinding%5BipAddressId%5D%5D%2CprimaryIpAddressRecord%5Bsubnet%2CguestNetworkComponentBinding%5BipAddressId%5D%5D%2CsecurityGroupBindings%5BsecurityGroup%5D%5D%2CprimaryBackendNetworkComponent%5BnetworkVlan%5Bid%5D%2CprimaryIpAddressRecord%5Bsubnet%2CguestNetworkComponentBinding%5BipAddressId%5D%5D%2CsecurityGroupBindings%5BsecurityGroup%5D%5D%2CevaultNetworkStorage%5BcapacityGb%5D%5D
2021-04-01T19:57:27.764+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:27 [DEBUG] Parameters:  
2021-04-01T19:57:29.149+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:29 [DEBUG] Status Code:  200
zrZdrrDwXEm8DDLsYf8+BOac7YDWRyal3ZrE\/QFsWLgpccXXX8TfF4A374iYseevBoz58cy4h8WEqGHvOfBvR\/pNuU9S2tyDcVf8jOs+jVr1p7U7jvkWDiHE8EQhOC0lBnGKJBSoEqXvR9QMJy3SkK6a3juzPuJuYEfYhBjTinInXC67c80wiTbz44FMPTJ1M7mlfgANZg9dAHj9U8QikSoHcQ2tknybiVpmBZPzuz3tDy6Vi8dERltupP53SNk= harinireddy@Harinis-MacBook-Pro.local","label":"harinisshkey","modifyDate":null}],"status":{"keyName":"ACTIVE","name":"Active"},"tagReferences":[],"transientGuestFlag":false,"userData":[]}
2021-04-01T19:57:29.150+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:29 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Account/getPublicSubnets.json?objectFilter=%7B%22publicSubnets%22%3A%7B%22endPointIpAddress%22%3A%7B%22ipAddress%22%3A%7B%22operation%22%3A%22169.45.4.53%22%7D%7D%7D%7D&objectMask=mask%5BipAddresses%5Bid%2CipAddress%5D%2CsubnetType%5D
2021-04-01T19:57:29.150+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:29 [DEBUG] Parameters:  
2021-04-01T19:57:30.489+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:30 [DEBUG] Status Code:  200
2021-04-01T19:57:30.489+0530 [DEBUG] plugin.terraform-provider-ibm: 2021/04/01 19:57:30 [DEBUG] Response:  []
2021/04/01 19:57:30 [WARN] Provider "registry.terraform.io/-/ibm" produced an unexpected new value for ibm_compute_vm_instance.virtual_server, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .local_disk: was cty.True, but now cty.False
      - .transient: was null, but now cty.False
      - .notes: was null, but now cty.StringVal("")
      - .hourly_billing: was cty.True, but now cty.False
      - .network_speed: was cty.NumberIntVal(100), but now cty.NumberIntVal(1000)
      - .dedicated_acct_host_only: was null, but now cty.False
      - .os_reference_code: was null, but now cty.StringVal("DEBIAN_9_64")
ibm_compute_vm_instance.virtual_server: Creation complete after 5m17s [id=118459208]
2021-04-01T19:57:30.503+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-04-01T19:57:30.506+0530 [DEBUG] plugin: plugin process exited: path=/Users/harinireddy/terraform/terraform-provider-ibm pid=47681
2021-04-01T19:57:30.507+0530 [DEBUG] plugin: plugin exited

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
I can see the order goes successfully
